text = '''Определение поэзии

Это — круто налившийся свист,
Это — щелканье сдавленных льдинок.
Это — ночь, леденящая лист,
Это — двух соловьев поединок.
Это — сладкий заглохший горох,
Это — слезы вселенной в лопатках,
Это — с пультов и с флейт — Figaro
Низвергается градом на грядку.
Всё. что ночи так важно сыскать
На глубоких купаленных доньях,
И звезду донести до садка
На трепещущих мокрых ладонях.
Площе досок в воде — духота.
Небосвод завалился ольхою,
Этим звездам к лицу б хохотать,
Ан вселенная — место глухое.

Во всем мне хочется дойти…

Во всем мне хочется дойти
До самой сути.
В работе, в поисках пути,
В сердечной смуте.
До сущности протекших дней,
До их причины,
До оснований, до корней,
До сердцевины.
Всё время схватывая нить
Судеб, событий,
Жить, думать, чувствовать, любить,
Свершать открытья.
О, если бы я только мог
Хотя отчасти,
Я написал бы восемь строк
О свойствах страсти.
О беззаконьях, о грехах,
Бегах, погонях,
Нечаянностях впопыхах,
Локтях, ладонях.
Я вывел бы ее закон,
Ее начало,
И повторял ее имен
Инициалы.
Я б разбивал стихи, как сад.
Всей дрожью жилок
Цвели бы липы в них подряд,
Гуськом, в затылок.
В стихи б я внес дыханье роз,
Дыханье мяты,
Луга, осоку, сенокос,
Грозы раскаты.
Так некогда Шопен вложил
Живое чудо
Фольварков, парков, рощ, могил
В свои этюды.
Достигнутого торжества
Игра и мука -
Натянутая тетива
Тугого лука.

Быть знаменитым некрасиво…

Быть знаменитым некрасиво.
Не это подымает ввысь.
Не надо заводить архива,
Над рукописями трястись.
Цель творчества — самоотдача,
А не шумиха, не успех.
Позорно, ничего не знача,
Быть притчей на устах у всех.
Но надо жить без самозванства,
Так жить, чтобы в конце концов
Привлечь к себе любовь пространства,
Услышать будущего зов.
И надо оставлять пробелы
В судьбе, а не среди бумаг,
Места и главы жизни целой
Отчеркивая на полях.
И окунаться в неизвестность,
И прятать в ней свои шаги,
Как прячется в тумане местность,
Когда в ней не видать ни зги.
Другие по живому следу
Пройдут твой путь за пядью пядь,
Но пораженья от победы
Ты сам не должен отличать.
И должен ни единой долькой
Не отступаться от лица,
Но быть живым, живым и только,
Живым и только до конца.

        Стихотворения Юрия Живаго[1]

1. ГАМЛЕТ[2]

Гул затих. Я вышел на подмостки.
Прислонясь к дверному косяку,
Я ловлю в далеком отголоске
Что случится на моем веку.
На меня наставлен сумрак ночи
Тысячью биноклей на оси.
Если только можно, Авва Отче,
Чашу эту мимо пронеси[3].
Я люблю твой замысел упрямый
И играть согласен эту роль.
Но сейчас идет другая драма,
И на этот раз меня уволь.
Но продуман распорядок действий,
И неотвратим конец пути.
Я один, все тонет в фарисействе[4].
Жизнь прожить — не поле перейти.

2. МАРТ
Солнце греет до седьмого пота,
И бушует, одурев, овраг.
Как у дюжей скотницы работа,
Дело у весны кипит в руках.
Чахнет снег и болен малокровьем
В веточках бессильно синих жил.
Но дымится жизнь в хлеву коровьем,
И здоровьем пышут зубья вил.
Эти ночи, эти дни и ночи!
Дробь капелей к середине дня,
Кровельных сосулек худосочье,
Ручейков бессонных болтовня!
Настежь все, конюшня и коровник.
Голуби в снегу клюют овес,
И всего живитель и виновник, —
Пахнет свежим воздухом навоз.

3. НА СТРАСТНОЙ[5]
Еще кругом ночная мгла.
Еще так рано в мире,
Что звездам в небе нет числа,
И каждая, как день, светла,
И если бы земля могла,
Она бы Пасху проспала
Под чтение Псалтыри[6].
Еще кругом ночная мгла.
Такая рань на свете,
Что площадь вечностью легла
От перекрестка до угла,
И до рассвета и тепла
Еще тысячелетье.
Еще земля голым-гола,
И ей ночами не в чем
Раскачивать колокола
И вторить с воли певчим.
И со Страстного четверга
Вплоть до Страстной субботы
Вода буравит берега
И вьет водовороты.
И лес раздет и непокрыт,
И на Страстях Христовых,
Как строй молящихся, стоит
Толпой стволов сосновых.
А в городе, на небольшом
Пространстве, как на сходке,
Деревья смотрят нагишом
В церковные решетки.
И взгляд их ужасом объят.
Понятна их тревога.
Сады выходят из оград,
Колеблется земли уклад:
Они хоронят Бога.
И видят свет у царских врат,
И черный плат, и свечек ряд,
Заплаканные лица —
И вдруг навстречу крестный ход
Выходит с плащаницей[7],
И две березы у ворот
Должны посторониться.
И шествие обходит двор
По краю тротуара,
И вносит с улицы в притвор
Весну, весенний разговор
И воздух с привкусом просфор
И вешнего угара.
И март разбрасывает снег
На паперти толпе калек,
Как будто вышел человек,
И вынес, и открыл ковчег[8],
И все до нитки роздал.
И пенье длится до зари,
И, нарыдавшись вдосталь,
Доходят тише изнутри
На пустыри под фонари
Псалтырь или Апостол[9].
Но в полночь смолкнут тварь и плоть,
Заслышав слух весенний,
Что только-только распогодь,
Смерть можно будет побороть
Усильем Воскресенья.





4. БЕЛАЯ НОЧЬ[10]
Мне далекое время мерещится,
Дом на Стороне Петербургской.
Дочь степной небогатой помещицы,
Ты — на курсах, ты родом из Курска.
Ты — мила, у тебя есть поклонники.
Этой белою ночью мы оба,
Примостясь на твоем подоконнике,
Смотрим вниз с твоего небоскреба.
Фонари, точно бабочки газовые,
Утро тронуло первою дрожью.
То, что тихо тебе я рассказываю,
Так на спящие дали похоже.
Мы охвачены тою же самою
Оробелою верностью тайне,
Как раскинувшийся панорамою
Петербург за Невою бескрайней.
Там вдали, по дремучим урочищам,
Этой ночью весеннею белой,
Соловьи славословьем грохочущим
Оглашают лесные пределы.
Ошалелое щелканье катится,
Голос маленькой птички ледащей
Пробуждает восторг и сумятицу
В глубине очарованной чащи.
В те места босоногою странницей
Пробирается ночь вдоль забора,
И за ней с подоконника тянется
След подслушанного разговора.
В отголосках беседы услышанной
По садам, огороженным тесом,
Ветви яблоновые и вишенные
Одеваются цветом белёсым.
И деревья, как призраки, белые
Высыпают толпой на дорогу,
Точно знаки прощальные делая
Белой ночи, видавшей так много.

10. БАБЬЕ ЛЕТО
Лист смородины груб и матерчат.
В доме хохот и стекла звенят,
В нем шинкуют, и квасят, и перчат,
И гвоздики кладут в маринад.
Лес забрасывает, как насмешник,
Этот шум на обрывистый склон,
Где сгоревший на солнце орешник
Словно жаром костра опален.
Здесь дорога спускается в балку,
Здесь и высохших старых коряг,
И лоскутницы осени жалко,
Все сметающей в этот овраг.
И тою, что вселенная проще,
Чем иной полагает хитрец,
Что как в воду опущена роща,
Что приходит всему свой конец.
Что глазами бессмысленно хлопать,
Когда все пред тобой сожжено,
И осенняя белая копоть
Паутиною тянет в окно.
Ход из сада в заборе проломан
И теряется в березняке.
В доме смех и хозяйственный гомон,
Тот же гомон и смех вдалеке.

12. ОСЕНЬ
Я дал разъехаться домашним,
Все близкие давно в разброде,
И одиночеством всегдашним
Полно все в сердце и природе.
И вот я здесь с тобой в сторожке,
В лесу безлюдно и пустынно.
Как в песне, стежки и дорожки
Позаросли наполовину.
Теперь на нас одних с печалью
Глядят бревенчатые стены.
Мы брать преград не обещали,
Мы будем гибнуть откровенно.
Мы сядем в час и встанем в третьем,
Я с книгою, ты с вышиваньем,
И на рассвете не заметим,
Как целоваться перестанем.
Еще пышней и бесшабашней
Шумите, осыпайтесь, листья,
И чашу горечи вчерашней
Сегодняшней тоской превысьте.
Привязанность, влеченье, прелесть!
Рассеемся в сентябрьском шуме!
Заройся вся в осенний шелест!
Замри, или ополоумей!
Ты так же сбрасываешь платье,
Как роща сбрасывает листья,
Когда ты падаешь в объятье
В халате с шелковою кистью.
Ты — благо гибельного шага,
Когда житье тошней недуга,
А корень красоты — отвага,
И это тянет нас друг к другу.

14. АВГУСТ
Как обещало, не обманывая,
Проникло солнце утром рано
Косою полосой шафрановою
От занавеси до дивана.
Оно покрыло жаркой охрою
Соседний лес, дома поселка,
Мою постель, подушку мокрую
И край стены за книжной полкой.
Я вспомнил, по какому поводу
Слегка увлажнена подушка.
Мне снилось, что ко мне на проводы
Шли по лесу вы друг за дружкой.
Вы шли толпою, врозь и парами,
Вдруг кто-то вспомнил, что сегодня
Шестое августа по старому,
Преображение Господне[15].
Обыкновенно свет без пламени
Исходит в этот день с Фавора[16],
И осень, ясная как знаменье,
К себе приковывает взоры.
И вы прошли сквозь мелкий, нищенский,
Нагой, трепещущий ольшаник
В имбмрно-красный лес кладбищенский,
Горевший, как печатный пряник.
С притихшими его вершинами
Соседствовало небо важно,
И голосами петушиными
Перекликалась даль протяжно.
В лесу казенной землемершею
Стояла смерть среди погоста,
Смотря в лицо мое умершее,
Чтоб вырыть яму мне по росту.
Был всеми ощутим физически
Спокойный голос чей-то рядом.
То прежний голос мой провидческий
Звучал, нетронутый распадом:
"Прощай, лазурь Преображенская
И золото второго Спаса,
Смягчи последней лаской женскою
Мне горечь рокового часа.
Прощайте, годы безвременщины.
Простимся, бездне унижений
Бросающая вызов женщина!
Я — поле твоего сраженья.
Прощай, размах крыла расправленный,
Полета вольное упорство,
И образ мира, в слове явленный,
И творчество, и чудотворство".

15. ЗИМНЯЯ НОЧЬ
Мело, мело по всей земле
Во все пределы.
Свеча горела на столе,
Свеча горела.
Как летом роем мошкара
Летит на пламя,
Слетались хлопья со двора
К оконной раме.
Метель лепила на стекле
Кружки и стрелы.
Свеча горела на столе,
Свеча горела.
На озаренный потолок
Ложились тени,
Скрещенья рук, скрещенья ног,
Судьбы скрещенья.
И падали два башмачка
Со стуком на пол.
И воск слезами с ночника
На платье капал.
И все терялось в снежной мгле
Седой и белой.
Свеча горела на столе,
Свеча горела.
На свечку дуло из угла,
И жар соблазна
Вздымал, как ангел, два крыла
Крестообразно.
Мело весь месяц в феврале,
И то и дело
Свеча горела на столе,
Свеча горела.

25. ГЕФСИМАНСКИЙ САД[29]
Мерцаньем звезд далеких безразлично
Был поворот дороги озарен.
Дорога шла вокруг горы Масличной,
Внизу под нею протекал Кедрон[30].
Лужайка обрывалась с половины.
За нею начинался Млечный путь.
Седые серебристые маслины
Пытались вдаль по воздуху шагнуть.
В конце был чей-то сад, надел земельный.
Учеников оставив за стеной,
Он им сказал: "Душа скорбит смертельно,
Побудьте здесь и бодрствуйте со мной".
Он отказался без противоборства,
Как от вещей, полученных взаймы,
От всемогущества и чудотворства,
И был теперь, как смертные, как мы.
Ночная даль теперь казалась краем
Уничтоженья и небытия.
Простор вселенной был необитаем,
И только сад был местом для житья.
И, глядя в эти черные провалы,
Пустые, без начала и конца,
Чтоб эта чаша смерти миновала,
В поту кровавом он молил отца.
Смягчив молитвой смертную истому,
Он вышел за ограду. На земле
Ученики, осиленные дремой,
Валялись в придорожном ковыле.
Он разбудил их: "Вас Господь сподобил
Жить в дни мои, вы ж разлеглись, как пласт.
Час Сына Человеческого пробил.
Он в руки грешников себя предаст".
И лишь сказал, неведомо откуда
Толпа рабов и скопище бродяг,
Огни, мечи и впереди — Иуда
С предательским лобзаньем на устах[31].
Петр дал мечом отпор головорезам
И ухо одному из них отсек.
Но слышит: "Спор нельзя решать железом,
Вложи свой меч на место, человек.
Неужто тьмы крылатых легионов
Отец не снарядил бы мне сюда?
И, волоска тогда на мне не тронув,
Враги рассеялись бы без следа.
Но книга жизни подошла к странице,
Которая дороже всех святынь.
Сейчас должно написанное сбыться,
Пускай же сбудется оно. Аминь.
Ты видишь, ход веков подобен притче
И может загореться на ходу.
Во имя страшного ее величья
Я в добровольных муках в гроб сойду.
Я в гроб сойду и в третий день восстану,
И, как сплавляют по реке плоты,
Ко мне на суд, как баржи каравана,
Столетья поплывут из темноты".
'''

text = ''

LINES = ""

avatar_string = '''⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣅⠲⢿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⢻⣿⣿⣿
⣿⣿⣿⣿⡀⡀⠀⢤⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⣻⠁⣠⣼⣿⣿⣿
⣿⣿⣿⣿⣇⠀⢸⣽⣿⡿⢿⡿⠿⣟⢻⣿⡿⣻⠿⢿⣿⣿⣿⣯⡧⠴⢪⣽⣿⣿
⣿⣿⣿⣿⣿⡤⢖⣛⣀⠀⠿⠀⠀⠉⠙⡛⠩⢋⠀⠠⡿⠀⢈⡻⢮⣼⣿⣿⣿⣿
⣿⣿⣿⣿⠿⠴⡿⣿⣿⣿⣶⡀⠀⠀⢀⢀⡀⠐⠀⢠⣶⣾⣿⣿⣿⠜⢿⣿⣿⣿
⣿⣿⣿⣿⣆⠀⡉⠛⠛⠛⢻⡧⡄⠀⠀⠉⠁⠀⣠⣿⡾⠛⠿⠟⠋⢀⣤⣿⣿⣿
⣿⣿⣏⢡⣕⣷⣏⡛⠦⠔⠛⢘⣿⣶⣤⢤⣤⣤⣟⠙⠳⠆⠢⣳⣿⡾⣋⡻⣿⣿
⣿⣿⡏⢉⣉⣛⡧⠞⠓⠒⠀⠀⠉⠻⣿⣿⡿⠋⠉⠀⠀⠰⠺⠴⠿⠉⢙⣿⣿⣿
⣿⣿⡃⡀⠀⠀⠀⠀⢂⡀⠀⠀⠀⠀⣹⣟⡀⠀⠀⠀⡀⢀⠀⠐⠀⠋⠉⢸⣿⣿
⣟⡏⠁⢀⠀⠒⠀⠤⣭⣿⣧⣀⣉⠀⠀⠀⠉⢉⡀⠚⠋⠀⠀⠀⠀⠀⢀⣿⣿⣽
⣿⣇⠀⠀⢤⡄⠀⠀⠀⠀⠀⠈⠉⠉⠙⠋⠙⠁⠀⠀⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿
⠃⢘⣦⡄⠀⠈⠠⠄⣀⠀⠀⠀⢀⡆⠀⠀⠀⠀⠀⠀⠀⡀⣀⣤⣾⣿⠿⢿⣿⣿
⣸⣷⣾⣿⣷⣶⣤⣼⣿⣻⣓⣫⠋⠃⣀⠀⣎⠐⣶⢿⣿⡿⠿⠏⠉⣀⣠⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣺⣿⣮⣷⣵⣷⣷⣵⣶⣴⣿⣿⣿⣿⣿'''
name_string = 'The Suspicious Car'
loc_map_string = '''
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⠤⠀⠀⢀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡴⠛⠋⠉⣠⡀⠀⠀⠿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⠋⠀⣠⡴⠋⡇⠙⢦⡀⠈⢦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⠎⠀⣰⠁⠀⠀⡇⠀⠀⠙⡄⠀⢱⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⠀⠀⣿⠀⠀⠀⣀⠀⠀⠀⠁⠀⠘⠳⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠰⠁⠀⠀⣿⠶⠆⠀⣿⠀⠰⠆⣶⠀⠀⠀⠙⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢿⣀⣀⠀⢿⣀⠀⠀⢛⠀⢀⣀⣭⠀⣀⣀⠤⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⢀⣠⡄⠀⢠⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠛⠒⠋⠛⠐⠚⠘⠛⠛⠀⠘⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣄⣀⣠⣤⠤⣄⡀⣀⠀⡀⠀⠀⠀⠀⠀
⠀⠀⢠⡶⢉⣡⡄⣤⣤⡈⠉⢳⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡼⠉⠀⠈⢹⠋⠀⠀⠈⢻⠉⠀⣙⣶⠀⠀⠀⠀
⠀⡰⠇⠰⠋⠀⢀⣀⠀⠘⠧⡀⢿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣟⣀⣛⠁⣰⣙⠟⠘⠫⣼⣩⠷⠷⠿⣀⠀⠀⠀
⠀⠃⠀⢿⠀⢘⡻⣍⠛⡆⠈⣿⠈⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠛⠁⠀⠉⢹⠟⠁⠀⠀⠀⠀⣯⠀⠀⠀⠛⢦⠀⠀
⠀⢣⠀⠈⢶⣌⡁⣉⣴⠃⣰⠋⡖⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢶⠆⠀⠀⢱⠀⠀⠀⠀⠀⠀⡆⠀⠀⠀⠀⢀⠀⠀
⠀⠈⠣⣄⠀⠀⠀⢀⣠⠞⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠺⢾⡇⣰⣖⡇⠀⠀⠀⠀⣤⠿⣀⠀⣀⣠⡗⠀⠀
⠀⠀⠀⠀⠙⠛⠛⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠁⠀⠈⠹⠛⠻⠎⠁⠀⠈⠙⠋⠁⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡶⢰⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⡀⣀⠀⠀⠀⠀⢀⣸⠀⠸⢅⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⡔⠒⠢⢤⡄⠀⠀⠀⢀⡤⠐⢲⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⡯⠤⣜⢦⠀⠀⣰⠏⠀⠀⠀⠀⠷⠀⠀⠀⠀⠀⣠⠔⠛⢻⠇⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀⠶⠖⠚⠒⠒⠲⠋⠀⠀⠀⢩⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⡆⠀⢘⡋⠉⠈⠁⠀⠀⠀⠀⠀⠶⠆⠰⠶⠐⠊⠁⠀⢀⡇⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⡇⢀⣀⡀⠀⠀⢀⣴⣷⣀⠀⢀⣼⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠰⠞⠛⠁⠀⠈⣁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⠟⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣄⢛⡃⠀⠀⠐⢦⡤⠛⠀⣬⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠢⠄⣠⠀⠀⠀⠀⠀⠀⢀⣀⡀⣤⡤⠚⠋⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⡇⠈⠈⠁⠷⠞⠀⢀⡀⠀⣴⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡞⠁⠀⠀⠀⠀⠀⠳⢬⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠳⢄⣸⡶⠟⢃⣛⡵⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠛⠳⠶⠀⠠⠤⠀⠞⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠁⠀⠈⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀


'''

encounter_ph = '''.
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣗⣭⣄⣀⣸⣿⣿⡀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣀⣀⣀⣀⣀⣀⣀⣸⣿⣿⣇⡀⠀⢀⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⠙⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠁⠐⠛⣛⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⠀⠀⠀⠙⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⠁⠀⠀⠀⢘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⠀⠀⠀⠀⠀⠈⠛⠻⠏⠀⠀⠻⠻⠿⠛⠛⠿⣿⠿⣿⣿⡿⠿⢿⣿⣿⠿⠿⠿⠿⢿⠿⠿⢿⣿⡿⠟⠛⠉⠀⠀⠀⠀⢠⣾⣿⡿⢿⣿⣿⣿⣿⣿⣿⠟⠛⠛⠛⠛⢿
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠋⠉⠉⠀⠈⠉⠙⢿⣿⣿⣄⣀⣀⣀⣤⣿
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⠶⠶⣶⣦⣤⣤⣼⣿⣿⣿⣿⣿⣿⣿⣿
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣤⣤⣴⡶⠶⡦⢀⠀⠀⠀⠀⠀⠀⠀⠈⢹⣿⣿⣿⣿⣿⣿⣿⣿⣿
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣿⡟⠉⠀⠀⠀⠀⠘⠷⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿
⠀⢀⣴⣾⣿⣶⣦⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣿⣿⣿⣷⣶⣶⣶⣿⣿⣿⣷⣶⣤⣀⠀⠀⠀⠀⠀⠀⠻⣿⣿⣿⣿⣿⣿⣿⣿
⠀⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦⣤⣄⣀⣀⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡧⠀⠀⠀⠀⠀⠀⠈⢻⣿⣿⣿⣿⣿⣿
⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠻⣿⣿⣿⣿⣿
⠀⠈⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⣿⣿⣿⣿
⠀⠀⠀⠀⠉⠙⠛⠛⠛⠛⠛⠉⠙⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠻⡿⠉⠉⠉⠉⠉⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢿⣿⣿⣿
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⣿⣿
⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣠⣤⣤⣶⣶⣿⣿⣷⣦⡀⠀⠀⠀⣾⣿⣿⣿⣿
⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⣾⣿⣿⣷⣶⣴⣶⣾⣶⣶⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⠀⠀⢾⣿⣿⣿⣿
⣿⣿⣿⣤⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠰⠦⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⣸⣿⣿⣿⣿
⣿⣿⣿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣿⣿⣿⣿⣿⣿⣿⡿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⣀⣤⣤⣤⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠁⢰⣿⣿⣿⣿⣿
⣿⣿⣿⡷⠶⠶⠶⠶⠒⠶⠶⠶⠄⠀⠀⠀⠀⣀⣼⣿⣿⣿⣿⣿⣿⣿⣷⣄⣀⠀⠀⠀⠀⠛⠋⠙⢛⣉⣉⣩⣤⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠀⠀⢾⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣷⣶⣶⣶⣶⣶⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠅⠀⠀⠀⠀⠻⣿⣿⣿⣿
⢰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠻⣿⣿
⣿⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠻⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠙⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠈⠙⠻⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠻⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⣷⣄⡀⠀⠀⠀⠀⢀⣀⣀⣀⣀⣀⣀⣉⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣏⣁⣀⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀


'''

encounter_dragon_gates = '''
⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⣀⡀⠀⠀⣀⣀⣀⣤⡤⠤⠀⠀⠀⠀⠀⠀⠀⠀⢤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠘⢧⡀⠀⠀⢀⣀⣠⣤⡬⠿⠶⣶⠿⠶⠶⠶⣄⣀⠀⠀⠀⠀⠀⢀⣴⠞⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⢷⠀⣴⠏⠁⠀⠀⠀⠀⠀⡟⠀⠀⠀⠀⠀⠉⠻⣆⠀⠀⣰⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⢸⢰⠇⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⠀⠀⠀⠀⠀⠘⣇⠀⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⣟⡿⠀⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⠀⠀⠀⠀⠀⠀⠸⡆⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⢸⠁⠀⠀⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⡟⠀⠀⠀⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⢰⠇⠀⠀⠀⠀⠀⠀⠀⠀⢸⡁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⢀⣴⠾⠻⠶⢤⣤⣤⣤⡴⠶⠶⢞⡿⠋⠙⠿⣷⡶⠦⠴⠶⠞⠛⠉⠉⠙⠳⢦⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣰⠾⠁⠀⠀⠀⠀⠹⣆⡀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⣆⣠⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠏⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠙⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀

'''
encounter_title_dragon_gates = 'ВРАТА ДРАКОНА'

dg_branch_intro_1 = [
    ('После затяжного путешествия ты наконец подошел ко [bold red]ВРАТАМ ДРАКОНА[/bold red]. От твоей цели тебя отделяют всего лишь две огромнных каменных плиты высотой с великана.', 0),
    ('С небольшого расстояния ты замечаешь надпись, выгравированную на на камне.', 0),
    ('Подойти к плите?', 1)
]

dg_branch_intro_2 = [
    ('Похоже, на плите написано стихотворение:\n', 0),
    ('''[i]К своей смерти пришедий, отважный глупец, 
  Зайдя за врата, ты, считай, не жилец.
  Чтоб шансы против дракона в схатке иметь
  В ящера голову тебе нужно залезть!
  Познав дракона главный секрет,
  Вслух его выкрикни ты прямо здесь.[/i]''', 0),
  ('''[i]Чтоб о драконьем страхе узнать,
  Тебе четверых глупцов предстоит отыскать.
  Один - дракону нагло соврал.
  Другой - от дракона почти убежал.
  Третий - у дракона дома бывал.
  Последний - дракону правду сказал.[/i]''', 0),
  ('''[i]У каждого узника букву узнав,
  определить сможешь ты драконий страх.
  Ведь даже __________________________[/i]
   
  В стихотворении явно пропушены последнии слова.''', 0),
  ('''[bold]‼ По карте можно перемещаться, кликая по названию локации ‼
  ‼ Нажав на клавишу c можно посмотреть зацепки по каждой букве ‼[/bold]\n''', 2)
]

dg_options_intro = [
    ('Рассмотреть плиту поближе.', 1),
]

dg_next_branches_intro = {
    1: (dg_branch_intro_2, None, None)
}


encounter_giant = '''⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⣀⣀⠀⠀⠀⢠⣤⣤⣤⣤⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⣴⡟⠛⠉⠉⠛⢛⣷⠟⠉⠀⠀⠀⠙⢿⡞⠛⠛⠙⠛⢷⡄⠀⠀⠀⠀
⠀⠀⠀⢸⠇⠀⠀⣀⡀⠀⢸⡇⣀⣀⠀⠀⣀⣀⡀⣿⣠⣄⠀⣴⡶⣻⠀⠀⠀⠀
⠀⠀⠀⠸⣟⣀⣛⣋⠁⠀⢸⣇⣉⣭⠁⠠⠭⠭⣤⣿⢉⡽⠶⠴⠖⠻⣦⡀⠀⠀
⠀⢀⣶⠟⠙⠉⠉⠛⠳⢶⣾⡿⠋⠁⠀⠀⠀⠀⠉⢹⡿⠁⠀⠀⠀⠀⠈⣷⣀⠀
⠀⣿⠁⠀⠀⠀⠀⠀⣰⡾⠉⠀⠀⠀⠀⠀⠀⠀⠀⠈⣻⡆⠀⠀⠀⠀⠀⠈⠙⣧
⠀⠿⣶⡶⠀⠀⠀⠀⢻⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡏⠁⠀⠀⠀⠀⠀⠀⢀⣿
⠀⠀⣿⣀⣼⡇⠀⢀⡸⠷⣴⡀⠀⠀⠀⠀⠀⠀⣀⣈⣿⠀⠀⠀⠀⠀⠀⢀⣿⡅
⠀⠀⠈⠉⠹⢧⣴⡞⠳⠶⢿⣇⣀⣀⣀⣀⠀⣀⣽⠏⠛⠷⢲⣆⣠⣶⣶⠾⠉⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠛⠋⠙⠛⠛⠛⠀⠀⠀⠀⠀⠉⠛⠁⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀'''
encounter_title_giant = 'ТРЁХГЛАВЫЙ ГИГАНТ'

g_branch_intro_left = [
    ('''- Наша буква - Б.''', 4)

]

g_branch_intro_center = [
    ('''- На самом деле только я тут говорю правду!
  Голова хохочет.
  - Наша буква - П! И я понятия не имею, сколько в слове гласных!''', 5)]

g_branch_intro_right = [
    ('''- Левый не лжет. А еще в слове больше одной гласной.''', 3)
  ]

g_options_intro = [
    ('Опросить правую голову', 1),
    ('Опросить центральную голову', 2),
    ('Опросить левую голову', 3),
]

g_next_branches_intro = {
    1: (g_branch_intro_right, g_options_intro, 'self'),
    2: (g_branch_intro_center, g_options_intro, 'self'),
    3: (g_branch_intro_left, g_options_intro, 'self')
}

g_branch_intro_1 = [
    ('''На вершине холма сидит [bold green]ТРЁХГЛАВЫЙ ГИГАНТ[/bold green] в кандалах. Увидев, как ты подходишь, центральная голова раздаётся хохотом:
  - Смотрите парни, [i]"к своей смерти пришедий, отважный глупец"[/i] идёт! Каким же тупицей надо быть, чтобы самому полезть в логово дракона!
   
После этих слов одна из голов снова безудержно хохочет.''', 0),
  ('''С презрением смотря на смеющегося, правая голова качает головой. Левая же обращается к тебе:
  - Пришёл за нашей буквой? За сказанную одним из нас правду [bold red]ДРАКОН[/bold red] проклял нас. Теперь [bold]один за нас может говорить только правду[/bold], когда же [bold]остальныe только врать.[/bold]

Похоже тебе нужно опросить каждую голову, чтобы понять, какой буквой их наградил дракон.''', 1)
    ]

g_branch_intro_end = [
    ('''Ты опросил все три головы. К тебе снова обращается центральная:
  - Ну что, как считаешь, кто из нас соврал [bold red]ДРАКОНУ[/bold red] тогда?
  Голова снова начинает хохотать.''', 2),
]



